---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.LabelingDimWithGroupReferences
source: html/81195dd2-b66e-e83b-9b5a-54f02701a987.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.LabelingDimWithGroupReferences Property

Labeled constraints cannot participate in groups.

## Syntax (C#)
```csharp
public static FailureDefinitionId LabelingDimWithGroupReferences { get; }
```